# Факториел е математичка функција која го претставува производот на сите цели броеви од 1 до дадениот број (n).
# Се означува со n! и се дефинира како:
# n! = n * (n-1) * (n-2) * ... * 1
# На пример, 5! = 5 * 4 * 3 * 2 * 1 = 120
# По дефиниција, 0! е 1.

# Внесување на бројот од корисникот
number = int(input("Внеси број за пресметка на факториел: "))

# Иницијализација на резултатот
factorial = 1

# Пресметка на факториелот
for i in range(1, number + 1):
    factorial *= i

# Печатење на резултатот
print(f"Факториелот на {number} е: {factorial}")
