# Внесување на бројот n од корисникот
n = int(input("Внеси број n: "))

# Итерација низ сите броеви од 1 до n
for number in range(1, n + 1):
    # Проверка дали бројот се дели и со 3 и со 5
    if number % 3 == 0 and number % 5 == 0:
        print("#TriPet")
    # Проверка дали бројот се дели со 3
    elif number % 3 == 0:
        print("#Tri")
    # Проверка дали бројот се дели со 5
    elif number % 5 == 0:
        print("#Pet")
    # Ако бројот не се дели ни со 3 ни со 5, се печати самиот број
    else:
        print(number)
